# ============ НАСТРОЙКИ ============
BOT_TOKEN = "8952404727:AAFEjuthdB01y-yuyZ3qw_NhuhPV5q7Mhso"

YADISK_PUBLIC_URL = "https://disk.yandex.by/d/mfUQ5pAX_ScALw"

# ============ ГРУППЫ ============
GROUPS_BY_COURSE = {
    "1 курс (26)": [
        "126", "226", "326", "426", "526", "626", "726", "826",
        "926", "1026", "1126", "1226", "1326", "1426", "1526"
    ],
    "2 курс (25)": [
        "125", "225", "325", "425", "525", "625", "725", "825",
        "925", "1025", "1125", "1225", "1325", "1425", "1525"
    ],
    "3 курс (24)": [
        "124", "224", "324", "424", "524", "624", "724", "824",
        "924", "1024", "1124"
    ],
    "4 курс (23)": [
        "123", "223"
    ],
}

ALL_GROUPS = [g for groups in GROUPS_BY_COURSE.values() for g in groups]